Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/торо_ВнешнееОснованиеДляРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВнешнееОснованиеДляРабот</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ОбследованноеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ID</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="7c58d82d-a608-4033-a56b-11f5b496d2f1">
      <name>ОбъектРемонта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="13efe440-7374-4800-b6a4-495744f06814">
      <name>Описание</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir.Adaptation/src/Enums/торо_ВидыДокументовСогласованияРемонтов/торо_ВидыДокументовСогласованияРемонтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>торо_ВидыДокументовСогласованияРемонтов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="64eb183a-1b76-4429-aa1b-57e4cc199142">
    <name>торо_ВнешнееОснованиеДляРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2b394adb-1ebf-4922-857b-9874b3d4c03e">
    <name>торо_ВыявленныеДефекты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="35f75578-8d2f-4f0e-9148-b77abc4269db">
    <name>торо_ЗаявкаНаРемонт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="d0fa16de-b6ee-4c56-8fb4-513c07684830">
    <name>торо_АктОВыполненииЭтапаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

Project/Toir.Adaptation/src/Catalogs/торо_ОбъектыРемонта/торо_ОбъектыРемонта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bc7402bd-d283-40c7-9b61-dde80fafb3d8">
  <name>торо_ОбъектыРемонта</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="47be0c3c-665b-4830-8574-be2cb00622d6">
    <name>НомерПаспорта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="5959fb7d-0181-4005-b007-cc40a2b7939c">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8251a1bd-d678-4dbc-bd21-6454cb89086e">
    <name>УсловиеРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="934cd87a-75d4-4f33-b94c-1a7268168b99">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e8bc213a-2aad-4ac9-a27a-66bbeba601f7">
    <name>ВестиУчетСерийныхЗапчастей</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b3a58cb8-2443-4009-b5f6-f4cb4f657cb7">
    <name>ИнвентарныйНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="137abfc3-93b5-4dba-b32d-cd523dd8a9d9">
    <name>ДоговорКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="708b732b-9137-43b3-a14b-3163cb9aadb2">
    <name>КонтрагентИсполнительРемонта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e6a133e9-f30d-4180-b92c-26930eaeb626">
    <name>АдресМестонахождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0b40a8f-b23e-4ea3-8c69-401d995aed0a">
    <name>ВнешнийОбъект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ea3c21ff-2af7-4916-a866-e5b01c2fea11">
    <name>ДатаВводаВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="bc8196e3-5978-482f-b439-7243b365e6ef">
    <name>НеУчаствуетВПланировании</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b5ba0323-3b01-46d2-9bde-8c0207e1cb21">
    <name>ДатаВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eebb6ad6-7b6c-4e39-8fe5-992da135c1dd">
    <name>ТехНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="db977b56-8d4f-477d-bacd-96c656f0c4e2">
    <name>ЗаводскойНомер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="47fb0293-feaf-4992-8644-4f79efbe139f">
    <name>Изготовитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d385af4b-7522-4ee2-90b0-42e45425d027">
    <name>КодОР</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="83487b6e-133f-4515-acf1-81c067f764b5">
    <name>КодПоОКОФ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6408b474-ecee-4541-9bde-b1f79b146a49">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="411d399d-7893-49c5-833d-49f4491aff6b">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f389921f-a031-4484-9e7c-211c9ff6f3cf">
    <name>ПлановыйГрафикРаботы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0b0e085f-b80a-45ba-8729-f3d02e881457">
    <name>Направление</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="37be55ce-a45f-4bcb-811a-1111b86c4734">
    <name>ПодразделениеИсполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="94e46aa7-60a7-4a2b-b803-57b6770dd6b9">
    <name>Приоритет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c298ffb9-2689-44d1-8554-0f498c0e29f0">
    <name>СрокПолезногоИспользования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="213a88d1-10cd-4415-be87-6466d619cd88">
    <name>ТиповойОР</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="3bf26677-1440-4003-bb01-95200a087f95">
    <name>ЭтоАктив</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="33da016d-23b6-4b97-af50-ad3d5fcfa32d">
    <name>ФайлКартинки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9f4d4241-b7f9-404c-96be-63c46d087525">
    <name>ШтрихКод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="e407a623-3e39-4b3b-abd5-d2d822581628">
    <name>СтратегияОбслуживания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="97b21e2b-4075-4b3f-93d5-4e66ff55ecf2">
    <name>Широта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="63b57671-dba7-4a9b-b406-75124f7407c2">
    <name>Долгота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>14</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7036b49-7b66-497d-a122-8cac8c0e7fd9">
    <name>Высота</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="99b876ea-2a2a-4f0e-9d42-e4fb5ff631da">
    <name>ТипОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0e35030-1cc6-4122-be4c-227beecb8c28">
    <name>ТекСтатусВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6b745f16-26f4-4412-a0a1-69e4d7952bb0">
    <name>гкс_ОсновноеСредство</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1f797d16-918d-40e5-946e-e228860a3bf8">
    <name>гкс_КатегорияРиска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

Project/Toir.Adaptation/src/Documents/торо_ВнешнееОснованиеДляРабот/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура гкс_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// гкс+ [Релиз16] Деснол
	гкс_ДобавитьНовыеЭлементы();
	// гкс- [Релиз16]
	
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ДобавитьНовыеЭлементы(ЭтаФорма, Элементы.ДатаИНомер,
		Новый Структура("гкс_РеквизитыДаты", "Дата,ДатаСоздания"));
	// гкс+ [Релиз 1] Куст 
	Элементы.СпособСогласования.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("ПередЗаписью")
Процедура гкс_ПередЗаписью(Отказ, ПараметрыЗаписи)

	#Вставка
	// гкс+ [Перед записью] Куст
	МассивСтруктур = новый Массив();
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Организация", НСтр("ru='Организация';en='Organization'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Подразделение", НСтр("ru='Подразделение';en='Subdivision'")));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ДатаСоздания", Элементы.ДатаСоздания.Заголовок));
	МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Ответственный", НСтр("ru='Ответственный';en='Responsible'")));
	Для Каждого СтрокаМассива Из МассивСтруктур Цикл
		Если Не ЗначениеЗаполнено(Объект[СтрокаМассива.Имя]) Тогда 
			Сообщение = Новый СообщениеПользователю();
			ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
			Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
			Сообщение.Поле = "Объект." + СтрокаМассива.Имя;
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	//
	Если Объект.ОбследованноеОборудование.Количество() = 0 Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='В документе не указан ОР';en='The document does not specify an OR'");
		Сообщение.Сообщить();
		Отказ = Истина;
	Иначе
		МассивСтруктур = новый Массив();
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ОбъектРемонта", НСтр("ru='Объект ремонта';en='Object of repair'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Исполнитель", НСтр("ru='Исполнитель';en='Executor'")));
		// гкс+ [Релиз16] Деснол
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "ПлановаяДатаРемонта",
			НСтр("ru='Плановая дата начала';en='Scheduled start date'")));
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "гкс_ДатаОкончания",
			НСтр("ru='Плановая дата начала';en='Scheduled end date'")));
		// гкс- [Релиз16]
		МассивСтруктур.Добавить(Новый Структура("Имя,Текст", "Описание", НСтр("ru='Описание';en='Description'")));
		Для Каждого СтрокаМассива Из МассивСтруктур Цикл
			НомерПП = 0;
			Для Каждого СтрокаТаблицы Из Объект.ОбследованноеОборудование Цикл
				Если Не ЗначениеЗаполнено(СтрокаТаблицы[СтрокаМассива.Имя]) Тогда 
					Сообщение = Новый СообщениеПользователю();
					ШаблонСообщения = НСтр("ru='Поле ""%1"" не заполнено';en='Field %1 is empty'");
					Сообщение.Текст = СтрШаблон(ШаблонСообщения, СтрокаМассива.Текст);
					Сообщение.Поле = "Объект.ОбследованноеОборудование[" + НомерПП + "]." + СтрокаМассива.Имя;
					Сообщение.Сообщить();
					Отказ = Истина;
				КонецЕсли;
				НомерПП = НомерПП + 1;
			КонецЦикла;
		КонецЦикла;
		// гкс+ [Релиз16] Деснол
		НомерПП = 0;
		Для Каждого СтрокаТаблицы Из Объект.ОбследованноеОборудование Цикл
			Если ЗначениеЗаполнено(СтрокаТаблицы.гкс_ДатаОкончания) И
				СтрокаТаблицы.ПлановаяДатаРемонта > СтрокаТаблицы.гкс_ДатаОкончания Тогда 
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = НСтр("ru='Дата начала больше даты окончания';
				|en='Start date is greater than end date'");
				Сообщение.Поле = "Объект.ОбследованноеОборудование[" + НомерПП + "].гкс_ДатаОкончания";
				Сообщение.Сообщить();
			КонецЕсли;
		КонецЦикла;
		НомерПП = НомерПП + 1;
		// гкс- [Релиз16]
	КонецЕсли;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	#КонецВставки
КонецПроцедуры

&НаСервере
Процедура гкс_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	// гкс+ [Часовые пояса] Куст
	СтруктураПроверки = Новый Структура("гкс_СдвигЧП", Неопределено);
	ЗаполнитьЗначенияСвойств(СтруктураПроверки, ЭтотОбъект);
	Если Не СтруктураПроверки.гкс_СдвигЧП = Неопределено Тогда 
		гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, Объект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(ДатаКлиента)
	Если ЗначениеЗаполнено(Объект.Ссылка) = Ложь Тогда 
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,,,);
	// Заголовок формы++
	торо_РаботаСДиалогами.УстановитьЗаголовокФормыДокумента(Объект, ЭтаФорма, "");
	// Заголовок формы--
КонецПроцедуры

&НаКлиенте
Процедура гкс_ПриОткрытииПосле(Отказ)
	ПриОткрытииНаСервере(ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура гкс_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПСервера(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

&НаСервере
Процедура гкс_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	// гкс+ [Часовые пояса] Куст 
	гкс_ЧасовыеПоясаВызовСервера.ПеревестиНаЧПКлиента(ЭтаФорма,, ТекущийОбъект);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбора")
Процедура гкс_СпособСогласованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	Если СогласующиеРегистр.Количество() > 0 Тогда

		СтандартнаяОбработка = Ложь;
		ОписаниеОповещения = Новый ОписаниеОповещения("СпособСогласованияНачалоВыбораЗавершение",ЭтотОбъект,Новый Структура("Элемент",Элемент));
		ПоказатьВопрос(ОписаниеОповещения, НСтр("es='¡Los datos de los estatus establecidos del documento serán limpiados! ¿Continuar?';ru='Данные по установленным статусам документа будут очищены! Продолжить?';en='Data on the established statuses of the document will be cleared! Continue?'"), РежимДиалогаВопрос.ДаНет);

	КонецЕсли;
	#Вставка
	// гкс+ [Релиз 1] Куст 
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
	ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
	Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	#КонецВставки

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияНачалоВыбораЗавершение")
Процедура гкс_СпособСогласованияНачалоВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры)

	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		СогласующиеРегистр.Очистить();
		Если мХранитьИсториюСогласованияВДокументах Тогда
			Объект.Согласующие.Очистить();
		КонецЕсли;
		#Вставка
		// гкс+ [Релиз 1] Куст 
		ДопПараметры = Новый Структура("Отбор", Новый Структура("ПометкаУдаления", Ложь));
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",ДопПараметры,
		ДополнительныеПараметры.Элемент, , , , , РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецВставки
		#Удаление
		ОткрытьФорму("Справочник.торо_СпособыСогласованияДокументов.ФормаВыбора",,ДополнительныеПараметры.Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		#КонецУдаления
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СпособСогласованияПриИзменении")
Процедура гкс_СпособСогласованияПриИзменении(Элемент)

	Если фПослеОчистки = Ложь Тогда
		ОбновитьДеревоСогласующих(Истина);
		#Удаление
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,, Истина);
		#КонецУдаления
		#Вставка
		торо_РаботаССогласованиямиКлиентСервер.ДобавитьСтрокуВИсториюСтатусов(ЭтаФорма, СтатусДокументаРегистр,,);
		#КонецВставки
	Иначе
		фПослеОчистки = Ложь;
	КонецЕсли;

	УправлениеВидимостью(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	Если ЭтотОбъект["мИспользоватьСогласованиеДокументов"] И Элементы["СпособСогласования"].ТолькоПросмотр
		И Не СтатусДокументаРегистр = ЭтаФорма["гкс_СтатусЧерновик"] Тогда 
		Возврат;
	КонецЕсли;
	//
	Если Объект.ОбследованноеОборудование.Количество() > 0 Тогда 
		Способ = гкс_ПолучитьСпособСогласования(Объект.Организация, Объект.ОбследованноеОборудование[0].ОбъектРемонта, Объект.Ссылка);
		Если ЗначениеЗаполнено(Способ) И Не Объект.СпособСогласования = Способ Тогда 
			Объект.СпособСогласования = Способ;
			СпособСогласованияПриИзменении(Неопределено);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОрганизацияПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// гкс+ [Релиз16] Деснол
&НаСервере
Процедура гкс_ДобавитьНовыеЭлементы()
	// гкс+ [03.23] Деснол 13.03.2023
	Если Не РольДоступна("гкс_РедактированиеЗаявкиНаРемонт") Тогда 
		Элементы.Дата.ТолькоПросмотр = Истина;
	КонецЕсли;
	// гкс- [03.23] Деснол 13.03.2023
	// гкс+ [Перед записью] Куст 
	Элементы.ДеревоРемонтныхРабот.Видимость = Ложь;
	Элементы.ОбследованноеОборудованиеОписание.АвтоОтметкаНезаполненного = Истина;
	Элементы.ОбследованноеОборудованиеИсполнитель.АвтоОтметкаНезаполненного = Истина;
	Элементы.ОбследованноеОборудованиеТиповойДефект.Видимость = Ложь;
	// гкс+ [Релиз19] Деснол
	Если Не (РольДоступна("ПолныеПрава") 
		ИЛИ РольДоступна("гкс_РедактированиеЗаявкиНаРемонт")
		ИЛИ РольДоступна("Администрирование")) Тогда 
	// гкс- [Релиз19]
		Элементы.Ответственный.ТолькоПросмотр = Истина;
	КонецЕсли; // гкс- [Перед записью]
	//
	Элементы.Подразделение.УстановитьДействие("ПриИзменении","ПодразделениеПриИзменении");
	//
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить(Новый РеквизитФормы("гкс_СтатусЧерновик", Новый ОписаниеТипов("СправочникСсылка.торо_СтатусыСогласованияДокументовРемонтныхРабот")));
	ИзменитьРеквизиты(МассивРеквизитов);
	ЭтаФорма["гкс_СтатусЧерновик"] = справочники.торо_СтатусыСогласованияДокументовРемонтныхРабот.Черновик;
	//
	НКом = Команды.Добавить("дс_ОтправитьНаСогласование");
	НКом.Действие = "дс_ОтправитьНаСогласование";
	НКом.Заголовок = НСтр("ru='Отправить на согласование';en='Send for approval'");
	//
	НКноп = Элементы.Добавить("дс_ОтправитьНаСогласование",Тип("КнопкаФормы"),Элементы.ФормаКоманднаяПанель);
	НКноп.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НКноп.ИмяКоманды = "дс_ОтправитьНаСогласование";
	Элементы.Переместить(Элементы["дс_ОтправитьНаСогласование"],Элементы.ФормаКоманднаяПанель,Элементы.ФормаПроведение);
	дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
	//
	НовыйЭлемент = Элементы.Добавить("гкс_ДатаОкончания", Тип("ПолеФормы"), Элементы.ОбъектРемонтаИДатаОбработки);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ОбследованноеОборудование.гкс_ДатаОкончания";
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	// гкс+ [11.22] Деснол 03.11.2022
	НовыйЭлемент = Элементы.Вставить("гкс_ОРТехНомер", Тип("ПолеФормы"), Элементы.ОбъектРемонтаИДатаОбработки, Элементы.ОбследованноеОборудованиеПлановаяДатаРемонта);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ОбследованноеОборудование.ОбъектРемонта.ТехНомер";
	НовыйЭлемент.ТолькоПросмотр = Истина;
	// гкс- [11.22] Деснол 03.11.2022
	// гкс+ [Релиз18] Деснол
	НоваяКомандаФормы = Команды.Добавить("ОткрытьЗакрытиеЗаявокИРемонтов");
	НоваяКомандаФормы.Действие = "ОткрытьЗакрытиеЗаявокИРемонтов";
	НоваяКомандаФормы.Заголовок = НСтр("ru='Закрытие заявок и ремонтов';en='Closing applications and repairs'");
	//
	НоваяКнопкаФормы = Элементы.Добавить("гкс_ОткрытьЗакрытиеЗаявокИРемонтов",Тип("КнопкаФормы"), Элементы.ФормаКоманднаяПанель);
	НоваяКнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	НоваяКнопкаФормы.ИмяКоманды = "ОткрытьЗакрытиеЗаявокИРемонтов";
	Элементы.Переместить(Элементы["гкс_ОткрытьЗакрытиеЗаявокИРемонтов"],
		Элементы.ФормаКоманднаяПанель, Элементы.ФормаОбщаяКомандаДополнительныеСведенияКоманднаяПанель);
	// гкс- [Релиз18]
КонецПроцедуры
// гкс- [Релиз16]

&НаСервере
Функция гкс_ПолучитьСпособСогласования(Организация, ОбъектРемонта, ОбъектСсылка = Неопределено)
	Если торо_РаботаССогласованиями.гкс_ПоДокументуЕстьИстория(ОбъектСсылка) Тогда 
		Возврат Неопределено;
	КонецЕсли;
	Подр = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	торо_ОбъектыРемонта.Подразделение КАК Подразделение
		|ИЗ
		|	Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|ГДЕ
		|	торо_ОбъектыРемонта.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ОбъектРемонта);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Подр = Выборка.Подразделение;
	КонецЕсли;
	ПодрИсп = Справочники.СтруктураПредприятия.ПустаяСсылка();
	Для Каждого СтрокаТаблицы Из Объект.ОбследованноеОборудование Цикл
		Если ТипЗнч(СтрокаТаблицы.Исполнитель) = Тип("СправочникСсылка.СтруктураПредприятия") Тогда 
			ПодрИсп = СтрокаТаблицы.Исполнитель;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат торо_РаботаССогласованиями.гкс_ПолучитьСпособСогласованияПоУмолчанию(
		Перечисления.торо_ВидыДокументовСогласованияРемонтов.торо_ВнешнееОснованиеДляРабот,
		Организация, Подр, ПодрИсп);
КонецФункции

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеИсполнительПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Истина);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеОбъектРемонтаПриИзмененииПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеПослеУдаленияПосле(Элемент)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура гкс_ОбследованноеОборудованиеПриОкончанииРедактированияПосле(Элемент, НоваяСтрока, ОтменаРедактирования)
	ПодразделениеПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура дс_ОтправитьНаСогласование(Команда)
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Параметры1 = Новый Структура("дс_Выполнить", Истина);
		Параметры2 = Новый Структура();
		
		гкс_ОбщегоНазначенияСервер.ОтправитьНаСогласованиеНаСервере(Параметры1, Параметры2);
		Если Параметры1.дс_Выполнить Тогда 
			Параметры2.Вставить("Форма", ЭтаФорма);
			торо_РаботаССогласованиямиКлиент.ВыбратьСтатусЗавершение(Параметры1, Параметры2);
			дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура дс_ИзменитьВидимостьКнопкиОтправкиНаСогласование()
	гкс_ОбщегоНазначенияСервер.ИзменитьВидимостьКнопкиОтправкиНаСогласование(Элементы["дс_ОтправитьНаСогласование"],СтатусДокументаРегистр);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// гкс+ [Релиз18] Деснол
&НаКлиенте
Процедура ОткрытьЗакрытиеЗаявокИРемонтов(Команда)
	Если Объект.Проведен = Ложь Тогда 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru='Необходимо провести документ';en='you need to post a document'");
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ВыбранныеРемонты = Новый Массив;
	Для каждого Ремонт Из Объект.ОбследованноеОборудование Цикл
		ВыбранныеРемонты.Добавить(Ремонт.ID);
	КонецЦикла; 
	
	Отбор = Новый Структура;
	Отбор.Вставить("ID", ВыбранныеРемонты);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОтборРемонтов", Отбор);
	ПараметрыФормы.Вставить("ТекущаяСтраница", "ГруппаАварийныеРемонты");
	
	ОткрытьФорму("Обработка.торо_ЗакрытиеЗаявокИРемонтов.Форма.Форма", ПараметрыФормы,,,,,,);
	
КонецПроцедуры
// гкс- [Релиз18]
#КонецОбласти
